nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*
 * Copyright 2019-2022 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins_cm4(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA0 (coord B10), BUTTON_NMI
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW2_PERIPHERAL GPIOA                  /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW2_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW2_CHANNEL 0                         /*!<@brief Signal channel */
#define BOARD_INITBUTTONSPINS_SW2_PIN_NAME PTA0                     /*!<@brief Routed pin name */
#define BOARD_INITBUTTONSPINS_SW2_LABEL "BUTTON_NMI"                /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW2_NAME "SW2"                        /*!<@brief Identifier */
#define BOARD_INITBUTTONSPINS_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW2_GPIO GPIOA                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN 0U                       /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW2_GPIO_PIN_MASK (1U << 0U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW2_PORT PORTA                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW2_PIN 0U                            /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW2_PIN_MASK (1U << 0U)               /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PORTE8 (coord P16), BUTTON_LLWUP23
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW3_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW3_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW3_CHANNEL 8                         /*!<@brief Signal channel */
#define BOARD_INITBUTTONSPINS_SW3_PIN_NAME PTE8                     /*!<@brief Routed pin name */
#define BOARD_INITBUTTONSPINS_SW3_LABEL "BUTTON_LLWUP23"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW3_NAME "SW3"                        /*!<@brief Identifier */
#define BOARD_INITBUTTONSPINS_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW3_FGPIO FGPIOE                      /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN 8U                       /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW3_GPIO_PIN_MASK (1U << 8U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW3_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW3_PIN 8U                            /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW3_PIN_MASK (1U << 8U)               /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PORTE9 (coord N16), BUTTON_LLWUP24
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW4_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW4_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW4_CHANNEL 9                         /*!<@brief Signal channel */
#define BOARD_INITBUTTONSPINS_SW4_PIN_NAME PTE9                     /*!<@brief Routed pin name */
#define BOARD_INITBUTTONSPINS_SW4_LABEL "BUTTON_LLWUP24"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW4_NAME "SW4"                        /*!<@brief Identifier */
#define BOARD_INITBUTTONSPINS_SW4_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW4_FGPIO FGPIOE                      /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW4_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW4_GPIO_PIN 9U                       /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW4_GPIO_PIN_MASK (1U << 9U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW4_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW4_PIN 9U                            /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW4_PIN_MASK (1U << 9U)               /*!<@brief PORT pin mask */
                                                                    /* @} */

