nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*! @name PORTE12 (coord L12), BUTTON_LLWUP26
  @{ */
/* Routed pin properties */
#define BOARD_INITBUTTONSPINS_SW5_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_INITBUTTONSPINS_SW5_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITBUTTONSPINS_SW5_CHANNEL 12                        /*!<@brief Signal channel */
#define BOARD_INITBUTTONSPINS_SW5_PIN_NAME PTE12                    /*!<@brief Routed pin name */
#define BOARD_INITBUTTONSPINS_SW5_LABEL "BUTTON_LLWUP26"            /*!<@brief Label */
#define BOARD_INITBUTTONSPINS_SW5_NAME "SW5"                        /*!<@brief Identifier */
#define BOARD_INITBUTTONSPINS_SW5_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_SW5_FGPIO FGPIOE                      /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW5_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW5_GPIO_PIN 12U                      /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_SW5_GPIO_PIN_MASK (1U << 12U)         /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITBUTTONSPINS_SW5_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_SW5_PIN 12U                           /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_SW5_PIN_MASK (1U << 12U)              /*!<@brief PORT pin mask */
                                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTA22 (coord B6), Q6[2]/LED_BLUE
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_RGB_BLUE_PERIPHERAL GPIOA                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_RGB_BLUE_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_RGB_BLUE_CHANNEL 22                         /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_RGB_BLUE_PIN_NAME PTA22                     /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_RGB_BLUE_LABEL "Q6[2]/LED_BLUE"             /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_BLUE_NAME "RGB_BLUE"                    /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_RGB_BLUE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_RGB_BLUE_GPIO GPIOA                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_BLUE_GPIO_PIN 22U                       /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_RGB_BLUE_GPIO_PIN_MASK (1U << 22U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_RGB_BLUE_PORT PORTA                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_BLUE_PIN 22U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_RGB_BLUE_PIN_MASK (1U << 22U)               /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PORTA23 (coord E6), Q7[5]/LED_GREEN
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_RGB_GREEN_PERIPHERAL GPIOA                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_RGB_GREEN_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_RGB_GREEN_CHANNEL 23                         /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_RGB_GREEN_PIN_NAME PTA23                     /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_RGB_GREEN_LABEL "Q7[5]/LED_GREEN"            /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_GREEN_NAME "RGB_GREEN"                   /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_RGB_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_RGB_GREEN_GPIO GPIOA                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_GREEN_GPIO_PIN 23U                       /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_RGB_GREEN_GPIO_PIN_MASK (1U << 23U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_RGB_GREEN_PORT PORTA                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_GREEN_PIN 23U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_RGB_GREEN_PIN_MASK (1U << 23U)               /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTA24 (coord D6), Q7[2]/LED_RED
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_RGB_RED_PERIPHERAL GPIOA                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_RGB_RED_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_RGB_RED_CHANNEL 24                         /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_RGB_RED_PIN_NAME PTA24                     /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_RGB_RED_LABEL "Q7[2]/LED_RED"              /*!<@brief Label */
#define BOARD_INITLEDSPINS_RGB_RED_NAME "RGB_RED"                     /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_RGB_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_RGB_RED_GPIO GPIOA                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_RED_GPIO_PIN 24U                       /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_RGB_RED_GPIO_PIN_MASK (1U << 24U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_RGB_RED_PORT PORTA                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_RGB_RED_PIN 24U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_RGB_RED_PIN_MASK (1U << 24U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PORTE0 (coord R14), G2[5]/RED_LED_STS
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_RED_LED_STS_PERIPHERAL GPIOE                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_RED_LED_STS_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_RED_LED_STS_CHANNEL 0                          /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_RED_LED_STS_PIN_NAME PTE0                      /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_RED_LED_STS_LABEL "G2[5]/RED_LED_STS"          /*!<@brief Label */
#define BOARD_INITLEDSPINS_RED_LED_STS_NAME "RED_LED_STS"                 /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_RED_LED_STS_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

