nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_RED_LED_STS_FGPIO FGPIOE                       /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_RED_LED_STS_GPIO GPIOE                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_RED_LED_STS_GPIO_PIN 0U                        /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_RED_LED_STS_GPIO_PIN_MASK (1U << 0U)           /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_RED_LED_STS_PORT PORTE                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_RED_LED_STS_PIN 0U                             /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_RED_LED_STS_PIN_MASK (1U << 0U)                /*!<@brief PORT pin mask */
                                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTC7 (coord N2), U40[1]/K32L_UART0_RX
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PERIPHERAL LPUART0           /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_SIGNAL RX                    /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PIN_NAME LPUART0_RX          /*!<@brief Routed pin name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_LABEL "U40[1]/K32L_UART0_RX" /*!<@brief Label */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_NAME "DEBUG_UART0_RX"        /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PORT PORTC                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PIN 7U                       /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_RX_PIN_MASK (1U << 7U)          /*!<@brief PORT pin mask */
                                                                             /* @} */

/*! @name PORTC8 (coord P3), U11[1]/K32L_UART0_TX
  @{ */
/* Routed pin properties */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PERIPHERAL LPUART0           /*!<@brief Peripheral name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_SIGNAL TX                    /*!<@brief Signal name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PIN_NAME LPUART0_TX          /*!<@brief Routed pin name */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_LABEL "U11[1]/K32L_UART0_TX" /*!<@brief Label */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_NAME "DEBUG_UART0_TX"        /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PORT PORTC                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PIN 8U                       /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART0_TX_PIN_MASK (1U << 8U)          /*!<@brief PORT pin mask */
                                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M4F */

/*! @name EXTAL32 (coord E16), Y1[1]/EXTAL_32KHZ
  @{ */
/* Routed pin properties */
#define BOARD_INITOSCPINS_EXTAL32_PERIPHERAL RTC            /*!<@brief Peripheral name */
#define BOARD_INITOSCPINS_EXTAL32_SIGNAL EXTAL32            /*!<@brief Signal name */
#define BOARD_INITOSCPINS_EXTAL32_PIN_NAME EXTAL32          /*!<@brief Routed pin name */
#define BOARD_INITOSCPINS_EXTAL32_LABEL "Y1[1]/EXTAL_32KHZ" /*!<@brief Label */
#define BOARD_INITOSCPINS_EXTAL32_NAME "EXTAL32"            /*!<@brief Identifier */
                                                            /* @} */

/*! @name XTAL32 (coord E17), Y1[2]/XTAL_32KHZ
  @{ */
/* Routed pin properties */
#define BOARD_INITOSCPINS_XTAL32_PERIPHERAL RTC           /*!<@brief Peripheral name */
#define BOARD_INITOSCPINS_XTAL32_SIGNAL XTAL32            /*!<@brief Signal name */
#define BOARD_INITOSCPINS_XTAL32_PIN_NAME XTAL32          /*!<@brief Routed pin name */
#define BOARD_INITOSCPINS_XTAL32_LABEL "Y1[2]/XTAL_32KHZ" /*!<@brief Label */
#define BOARD_INITOSCPINS_XTAL32_NAME "XTAL32"            /*!<@brief Identifier */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTE30 (coord G17), U14[4]/ACCEL_I2C3_SCL
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACCEL_SCL_PERIPHERAL LPI2C3             /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACCEL_SCL_SIGNAL SCL                    /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN_NAME LPI2C3_SCL           /*!<@brief Routed pin name */
#define BOARD_INITACCELPINS_ACCEL_SCL_LABEL "U14[4]/ACCEL_I2C3_SCL" /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_SCL_NAME "ACCEL_SCL"              /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_SCL_PORT PORTE                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN 30U                       /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN_MASK (1U << 30U)          /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PORTE29 (coord G15), U14[6]/ACCEL_I2C3_SDA
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACCEL_SDA_PERIPHERAL LPI2C3             /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACCEL_SDA_SIGNAL SDA                    /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN_NAME LPI2C3_SDA           /*!<@brief Routed pin name */
#define BOARD_INITACCELPINS_ACCEL_SDA_LABEL "U14[6]/ACCEL_I2C3_SDA" /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_SDA_NAME "ACCEL_SDA"              /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_SDA_PORT PORTE                    /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN 29U                       /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN_MASK (1U << 29U)          /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PORTE1 (coord R16), U14[11]/ACCEL_INT1
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACCEL_INT1_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACCEL_INT1_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACCEL_INT1_CHANNEL 1                         /*!<@brief Signal channel */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN_NAME PTE1                     /*!<@brief Routed pin name */
#define BOARD_INITACCELPINS_ACCEL_INT1_LABEL "U14[11]/ACCEL_INT1"        /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_INT1_NAME "ACCEL_INT1"                 /*!<@brief Identifier */
#define BOARD_INITACCELPINS_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

