nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCEL_INT1_FGPIO FGPIOE                      /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO_PIN 1U                       /*!<@brief GPIO pin number */
#define BOARD_INITACCELPINS_ACCEL_INT1_GPIO_PIN_MASK (1U << 1U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_INT1_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN 1U                            /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_INT1_PIN_MASK (1U << 1U)               /*!<@brief PORT pin mask */
                                                                         /* @} */

/*! @name PORTE22 (coord J16), U14[9]/ACCEL_INT2
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACCEL_INT2_PERIPHERAL GPIOE                  /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACCEL_INT2_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACCEL_INT2_CHANNEL 22                        /*!<@brief Signal channel */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN_NAME PTE22                    /*!<@brief Routed pin name */
#define BOARD_INITACCELPINS_ACCEL_INT2_LABEL "U14[9]/ACCEL_INT2"         /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_INT2_NAME "ACCEL_INT2"                 /*!<@brief Identifier */
#define BOARD_INITACCELPINS_ACCEL_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCEL_INT2_FGPIO FGPIOE                      /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO GPIOE                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO_PIN 22U                      /*!<@brief GPIO pin number */
#define BOARD_INITACCELPINS_ACCEL_INT2_GPIO_PIN_MASK (1U << 22U)         /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_INT2_PORT PORTE                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN 22U                           /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_INT2_PIN_MASK (1U << 22U)              /*!<@brief PORT pin mask */
                                                                         /* @} */

/*! @name PORTE27 (coord H14), U14[16]/ACCEL_RST
  @{ */
/* Routed pin properties */
#define BOARD_INITACCELPINS_ACCEL_RST_PERIPHERAL GPIOE                   /*!<@brief Peripheral name */
#define BOARD_INITACCELPINS_ACCEL_RST_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITACCELPINS_ACCEL_RST_CHANNEL 27                         /*!<@brief Signal channel */
#define BOARD_INITACCELPINS_ACCEL_RST_PIN_NAME PTE27                     /*!<@brief Routed pin name */
#define BOARD_INITACCELPINS_ACCEL_RST_LABEL "U14[16]/ACCEL_RST"          /*!<@brief Label */
#define BOARD_INITACCELPINS_ACCEL_RST_NAME "ACCEL_RST"                   /*!<@brief Identifier */
#define BOARD_INITACCELPINS_ACCEL_RST_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITACCELPINS_ACCEL_RST_FGPIO FGPIOE                       /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_RST_GPIO GPIOE                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_RST_GPIO_PIN 27U                       /*!<@brief GPIO pin number */
#define BOARD_INITACCELPINS_ACCEL_RST_GPIO_PIN_MASK (1U << 27U)          /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_RST_PORT PORTE                         /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_RST_PIN 27U                            /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_RST_PIN_MASK (1U << 27U)               /*!<@brief PORT pin mask */
                                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTB9 (coord F4), J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PERIPHERAL GPIOB
/*!
 * @brief Signal name */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_SIGNAL GPIO
/*!
 * @brief Signal channel */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_CHANNEL 9
/*!
 * @brief Routed pin name */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PIN_NAME PTB9
/*!
 * @brief Label */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_LABEL "J4[6]/J47[2]/ARDUINO_A2/ADC0_SE3"
/*!
 * @brief Identifier */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_NAME "SNS_LIGHT_ADC"

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_GPIO GPIOB
/*!
 * @brief GPIO pin number */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_GPIO_PIN 9U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_GPIO_PIN_MASK (1U << 9U)

/* Symbols to be used with PORT driver */
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PORT PORTB
/*!
 * @brief PORT pin number */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PIN 9U
/*!
 * @brief PORT pin mask */
#define BOARD_INITLIGHT_SENSORPINS_SNS_LIGHT_ADC_PIN_MASK (1U << 9U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLIGHT_SENSORPins(void); /* Function assigned for the Cortex-M4F */

/*! @name USB0_DM (coord T12), J8[2]/K32L_USB_DN
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB0_DM_PERIPHERAL USB0           /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB0_DM_SIGNAL DM                 /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB0_DM_PIN_NAME USB0_DM          /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB0_DM_LABEL "J8[2]/K32L_USB_DN" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DM_NAME "USB0_DM"            /*!<@brief Identifier */
                                                            /* @} */

