nxp-mcuxpresso/mcux-sdk/boards/frdmk32l3a6/project_template/cm4/pin_mux.h
/*! @name USB0_DP (coord T11), J8[3]/K32L_USB_DP
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB0_DP_PERIPHERAL USB0           /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB0_DP_SIGNAL DP                 /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB0_DP_PIN_NAME USB0_DP          /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB0_DP_LABEL "J8[3]/K32L_USB_DP" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DP_NAME "USB0_DP"            /*!<@brief Identifier */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M4F */

/*! @name PORTD11 (coord R11), J9[P1]/SDHC0_D2
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_D2_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_D2_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_D2_CHANNEL 2                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC0_D2_PIN_NAME SDHC0_D2         /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_D2_LABEL "J9[P1]/SDHC0_D2"   /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D2_NAME "SDHC0_D2"           /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_D2_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_D2_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_D2_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTD10 (coord P11), J9[P2]/SDHC0_D3
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_D3_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_D3_SIGNAL DATA               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_D3_CHANNEL 3                 /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC0_D3_PIN_NAME SDHC0_D3         /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_D3_LABEL "J9[P2]/SDHC0_D3"   /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D3_NAME "SDHC0_D3"           /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_D3_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_D3_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_D3_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTD9 (coord U11), J9[P3]/SDHC0_CMD
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_CMD_SIGNAL CMD               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PIN_NAME SDHC0_CMD       /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_CMD_LABEL "J9[P3]/SDHC0_CMD" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_CMD_NAME "SDHC0_CMD"         /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_CMD_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTD8 (coord T9), J9[P5]/SDHC0_DCLK
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PERIPHERAL USDHC0         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_SIGNAL DCLK               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PIN_NAME SDHC0_DCLK       /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_LABEL "J9[P5]/SDHC0_DCLK" /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_NAME "SDHC0_DCLK"         /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PORT PORTD                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PIN 8U                    /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_DCLK_PIN_MASK (1U << 8U)       /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORTD7 (coord P10), J9[P7]/SDHC0_D0
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_D0_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_D0_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_D0_CHANNEL 0                /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC0_D0_PIN_NAME SDHC0_D0        /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_D0_LABEL "J9[P7]/SDHC0_D0"  /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D0_NAME "SDHC0_D0"          /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_D0_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_D0_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_D0_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTD6 (coord U9), J9[P8]/SDHC0_D1
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SDHC0_D1_PERIPHERAL USDHC0        /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SDHC0_D1_SIGNAL DATA              /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SDHC0_D1_CHANNEL 1                /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SDHC0_D1_PIN_NAME SDHC0_D1        /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SDHC0_D1_LABEL "J9[P8]/SDHC0_D1"  /*!<@brief Label */
#define BOARD_INITSDHCPINS_SDHC0_D1_NAME "SDHC0_D1"          /*!<@brief Identifier */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SDHC0_D1_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SDHC0_D1_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SDHC0_D1_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTC27 (coord P6), J9[G1]/SD_DETECT
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_DETECT_PERIPHERAL GPIOC                  /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_DETECT_SIGNAL GPIO                       /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_DETECT_CHANNEL 27                        /*!<@brief Signal channel */
#define BOARD_INITSDHCPINS_SD_DETECT_PIN_NAME PTC27                    /*!<@brief Routed pin name */
#define BOARD_INITSDHCPINS_SD_DETECT_LABEL "J9[G1]/SD_DETECT"          /*!<@brief Label */
#define BOARD_INITSDHCPINS_SD_DETECT_NAME "SD_DETECT"                  /*!<@brief Identifier */
#define BOARD_INITSDHCPINS_SD_DETECT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_DETECT_GPIO GPIOC                        /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_DETECT_GPIO_PIN 27U                      /*!<@brief GPIO pin number */
#define BOARD_INITSDHCPINS_SD_DETECT_GPIO_PIN_MASK (1U << 27U)         /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITSDHCPINS_SD_DETECT_PORT PORTC                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_DETECT_PIN 27U                           /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD_DETECT_PIN_MASK (1U << 27U)              /*!<@brief PORT pin mask */
                                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void); /* Function assigned for the Cortex-M4F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
